{
  "metadata": {
    "chapter": 3,
    "title": "Councils of Insight — Divination and Secret Retrieval",
    "summary": "Indexed spirits sought when truth, intelligence, or hidden caches must be uncovered without alerting rival courts.",
    "keywords": [
      "divination",
      "intelligence",
      "secrecy",
      "research",
      "wards"
    ],
    "references": [
      {
        "title": "Dictionnaire Infernal",
        "author": "Jacques Collin de Plancy",
        "year": 1863,
        "url": "https://gallica.bnf.fr/ark:/12148/bpt6k10608703",
        "note": "Illustrated attestations for Haures, Vassago, and fellow truth-bearers."
      },
      {
        "title": "The Book of Abramelin",
        "author": "Abraham of Worms",
        "year": 1458,
        "url": "https://www.esotericarchives.com/abramelin/",
        "note": "Provides warding frameworks for interrogating knowledge spirits safely."
      },
      {
        "title": "The Testament of Solomon",
        "author": "F. C. Conybeare (trans.)",
        "year": 1898,
        "url": "https://www.sacred-texts.com/chr/tos/index.htm",
        "note": "Lists constraints Solomon used against questioners and archivists alike."
      }
    ],
    "approx_word_count": 560
  },
  "body": [
    "Invoke these entities when intelligence must be harvested quietly: they read minds, reveal caches, and surface secrets but demand disciplined questioning.",
    "Dantalion — Purpose: Mirror the thoughts of targets to predict their decisions. Manifestation: scholar bearing many faces of men and women at once. Favours: bound folios containing charcoal portraits of intended subjects. Wards: steady heartbeat exercises and mirrored wards to reflect his empathic projections.",
    "Caim — Purpose: Stall inquisitions with riddled answers until the summoner is ready to act. Manifestation: blackbird courtier perched upon a blade of frost. Favours: ink diluted with rainwater to blur certainties. Wards: write questions, seal them in wax, and open only after he departs so his paradox cannot attach.",
    "Foras — Purpose: Catalogue uncommon herbs, stones, and hidden archives needed for complex rites. Manifestation: lion-faced philosopher counting on copper abaci. Favours: labelled apothecary drawers and meticulously ordered specimen trays. Wards: maintain transparent inventories reviewed aloud at dawn to prevent quiet substitutions.",
    "Haures (Flauros) — Purpose: Extract hard truths about present or future events while threatening anyone unshielded. Manifestation: terrible leopard engulfed in radiance. Favours: sealed braziers inscribed with precise inquiries. Wards: stand within a triangle dusted with alum and cooled coals; break the interview the instant his temper rises.",
    "Vassago — Purpose: Recover lost knowledge and verify the veracity of prophecies. Manifestation: mild-mannered prince carrying an hourglass that runs backward. Favours: sand timers turned thrice precisely before consultation. Wards: stagger bells to disrupt linear time so his truths cannot anchor uninvited destinies.",
    "Valac — Purpose: Reveal concealed caches, hidden gateways, or buried contraband. Manifestation: child with angel wings riding a twin-headed dragon. Favours: miniature chests filled with river stones and sealed with beeswax. Wards: map lattices folded in iron cases prior to questioning keep his curiosities contained."
  ]
}
