{
  "metadata": {
    "chapter": 4,
    "title": "Vectors of Movement — Passage, Weather, and Terrain",
    "summary": "Listings for spirits engaged when travel must be controlled, storms weaponized, or infrastructure rewritten in hours instead of weeks.",
    "keywords": [
      "mobility",
      "weather",
      "transport",
      "infrastructure",
      "warding"
    ],
    "references": [
      {
        "title": "The Goetia of Dr. Rudd",
        "author": "Stephen Skinner & David Rankine",
        "year": 2007,
        "url": "https://www.skinner-house.com/goetia-of-dr-rudd.html",
        "note": "Annotated rituals for restraining Agares, Gaap, and allied movers."
      },
      {
        "title": "Grimorium Verum",
        "author": "Anonymous",
        "year": 1517,
        "url": "https://www.esotericarchives.com/grim/verum.htm",
        "note": "Source for maritime protections countering Focalor and Vine."
      },
      {
        "title": "Architectures of the Mirage",
        "author": "Sister Aurelia of Tyre",
        "year": 1694,
        "url": "https://www.esotericarchives.com/solomon/mirage.htm",
        "note": "Treatise on rearranging terrain without collapsing local leys."
      }
    ],
    "approx_word_count": 520
  },
  "body": [
    "Summon from this index to seize pathways: the listed spirits redirect wind, open gates, or rewrite stone, letting a campaign outpace any mortal logistics.",
    "Agares — Purpose: Unsettle enemy ranks by eroding morale and language cohesion. Manifestation: elder rider on a crocodile commanding deserters. Favours: vellum inscribed with contradictory proverbs pinned to door lintels. Wards: salt traced across thresholds and rehearsed countersigns maintain cohesion.",
    "Focalor — Purpose: Command coastal weather and scuttle fleets without direct engagement. Manifestation: winged man with a green beard rising from crashing surf. Favours: brine-filled chalices veiled in stormcloth. Wards: tarred cords knotted thrice and offerings of fresh water to neutral maritime spirits.",
    "Gaap — Purpose: Relocate people or objects instantly across liminal points. Manifestation: prince arriving at noonday flanked by four heralds bearing keys. Favours: silver keys kept warm against the skin and presented in mirrored pairs. Wards: braid alternating metals into doorway lintels; announce every departure to anchor space.",
    "Malphas — Purpose: Raise or dismantle infrastructure—towers, safe houses, or siege engines—overnight. Manifestation: crow-headed architect surrounded by phantom masons. Favours: freshly hewn timber dusted with salt and aligned by compass. Wards: recite inventory tallies while demolishing any unsolicited structure to deny covert roosts.",
    "Vine — Purpose: Reshape earth and conjure storms to obscure advances or expose hidden defenses. Manifestation: lion astride a black horse, carrying a viper entwined around his arm. Favours: blackthorn staves carved with spiral grooves and soaked in rainwater. Wards: bury nine iron nails in concentric circles around the worksite to ground his upheavals."
  ]
}
