{
  "metadata": {
    "chapter": 5,
    "title": "Vectors of Desire — Transformation and Aftermath",
    "summary": "Entries for spirits sought to reshape desire, rewrite personal trajectories, or stabilize volatile inspiration once a rite concludes.",
    "keywords": [
      "desire",
      "transformation",
      "alchemy",
      "inspiration",
      "containment"
    ],
    "references": [
      {
        "title": "The Grimoire of Pope Honorius",
        "author": "Anonymous",
        "year": 1629,
        "url": "https://www.esotericarchives.com/grim/honorius.htm",
        "note": "Provides banishments and seals for Sitri, Zagan, and allied disturbers."
      },
      {
        "title": "Clavis Goetia",
        "author": "Joseph H. Peterson (ed.)",
        "year": 2004,
        "url": "https://www.esotericarchives.com/solomon/clavis.htm",
        "note": "Variant sigils and working notes on Orias and Phenex."
      },
      {
        "title": "Manual of the Red Thread",
        "author": "Sisterhood of the Sleepers",
        "year": 1748,
        "url": "https://www.esotericarchives.com/solomon/redthread.htm",
        "note": "Guidelines for safeguarding intimacy after contact with night spirits."
      }
    ],
    "approx_word_count": 500
  },
  "body": [
    "Turn to this section when managing hearts, inspiration, or mutable substance: each spirit warps appetite or identity until properly channeled.",
    "Lilith — Purpose: Awaken autonomous desire and challenge complacent bonds. Manifestation: night sovereign woven from shadow and moonlit glass. Favours: silvered mirrors left beneath starlight. Wards: knot red thread around bedposts and declare ownership of shared spaces before midnight.",
    "Sitri — Purpose: Force confessions of love or lust to fracture alliances. Manifestation: leopard-headed prince whose laughter steals restraint. Favours: copper bracelets warmed against the heart before negotiation. Wards: pair cold iron rings and hide them in opposite corners to absorb his heat.",
    "Phenex — Purpose: Ignite artistic or doctrinal fervor that binds audiences. Manifestation: radiant phoenix singing verses that compel obedience. Favours: laurel wreaths kept from direct flame and sheet music inked in gold. Wards: answer his melodies with collective humming to disperse enchantment.",
    "Zagan — Purpose: Transmute liquor, metals, or reputations to feign sobriety and wealth. Manifestation: griffin-winged bull bearing alchemical retorts. Favours: decanters of aged spirits and scales balanced with unfamiliar coins. Wards: store ceremonial drink in sealed clay vessels; audit ledgers hourly to reveal false riches.",
    "Orias — Purpose: Realign social standing and ambition through precise planetary timing. Manifestation: lion with serpent tail riding a vaporous horse, tracing star maps midair. Favours: brass armillary spheres anointed with aromatic oils. Wards: misalign seating at councils and rotate gatherings between dawn and dusk so his geometries cannot settle."
  ]
}
