{
  "metadata": {
    "chapter": 2,
    "title": "Engines of Campaign — Command and Logistics",
    "summary": "Profiles of commanders and drillmasters summoned to sharpen troops, raise fortifications, or weaponize ruthless efficiency on the field.",
    "keywords": [
      "warfare",
      "logistics",
      "discipline",
      "siege",
      "countermeasure"
    ],
    "references": [
      {
        "title": "Liber Officiorum Spirituum",
        "author": "British Library Additional MS. 36674",
        "year": 1583,
        "url": "https://www.esotericarchives.com/solomon/officiorum.htm",
        "note": "Describes the martial offices of Malphas, Marchosias, and allied captains."
      },
      {
        "title": "Lemegeton Clavicula Salomonis: Ars Goetia",
        "author": "Joseph H. Peterson (ed.)",
        "year": 2001,
        "url": "https://www.esotericarchives.com/solomon/lemegeton.htm",
        "note": "Critical English edition detailing chains of command for Goetic generals."
      },
      {
        "title": "Treatise on Infernal Logistics",
        "author": "Magus Laurent du Chesne",
        "year": 1679,
        "url": "https://www.esotericarchives.com/solomon/logistics.htm",
        "note": "Field notes on supply-line protections against demonic sabotage."
      }
    ],
    "approx_word_count": 540
  },
  "body": [
    "Consult this roster when the objective is battlefield readiness: these spirits raise armies overnight, enforce discipline, and twist efficiency into terror if left unchecked.",
    "Alloces — Purpose: Instill violent precision within strike teams. Manifestation: roaring duke blazing from a thunderous horse with burning eyes. Favours: forged iron nails quenched in red wine before inspection. Wards: hang evenly spaced bells or metronomes around encampments to fracture his cadence.",
    "Eligos (Abigor) — Purpose: Map enemy logistics and provoke proud champions into costly duels. Manifestation: armored knight bearing an ensign of shifting sigils. Favours: miniature lances or cavalry tokens laid upon campaign maps. Wards: border every strategy parchment with ash and swear against unsanctioned single combat.",
    "Halphas — Purpose: Erect fortifications and armories with ruthless speed. Manifestation: stork-formed captain barking orders to spectral carpenters. Favours: iron nails bundled with hawk feathers and driven into fresh timber. Wards: scatter poppy seeds along perimeters; tally every new structure aloud to deny covert emplacements.",
    "Marchosias — Purpose: Forge elite shock troops loyal beyond reason. Manifestation: wolf with gryphon wings and serpent tail, exhaling sparks that brand uniforms. Favours: tempered blades presented point-down in sand. Wards: rotate command frequently and cleanse unit banners in flowing water to cool his mark.",
    "Ronove — Purpose: Drill etiquette, rhetoric, and obedience until raw recruits become cohesive cadres. Manifestation: courteous marquis accompanied by phantom scribes correcting posture. Favours: wax tablets engraved with drill schedules. Wards: alternate instructors and languages daily; reward thoughtful dissent to keep loyalty human."
  ]
}
