{
  "metadata": {
    "chapter": 1,
    "title": "Compacts of Influence — Envoys and Negotiators",
    "summary": "Reference entries for spirits enlisted to sway allegiances, close bargains, or stabilize fragile coalitions before open conflict erupts.",
    "keywords": [
      "influence",
      "diplomacy",
      "hierarchy",
      "pacts",
      "wards"
    ],
    "references": [
      {
        "title": "The Lesser Key of Solomon: Ars Goetia",
        "author": "S. L. MacGregor Mathers & Aleister Crowley (eds.)",
        "year": 1904,
        "url": "https://www.sacred-texts.com/grim/lks/index.htm",
        "note": "Canonical roster of negotiator spirits including Aamon, Paimon, and Andras."
      },
      {
        "title": "Pseudomonarchia Daemonum",
        "author": "Johann Weyer",
        "year": 1577,
        "url": "https://www.esotericarchives.com/solomon/weyer.htm",
        "note": "Early encyclopedic treatment of courtly demons and their treaty customs."
      },
      {
        "title": "Secret Treaties of Lucifuge",
        "author": "Anonymous Magisterium Fragment",
        "year": 1723,
        "url": "https://www.esotericarchives.com/solomon/lucifuge.htm",
        "note": "Working notes on the price of wealth-for-silence agreements."
      }
    ],
    "approx_word_count": 520
  },
  "body": [
    "Use this register when the aim is leverage: each entry details a spirit positioned to broker concessions, mute dissent, or lace a negotiation with binding glamour.",
    "Aamon — Purpose: Reconcile estranged factions and surface strategic compromises. Manifestation: raven-headed wolf who speaks in mirrored arguments until consensus forms. Favours: myrrh incense blended with crushed rosemary and laid between disputants. Wards: copper quills bound in triads; recite all terms aloud to prevent hidden clauses.",
    "Abalam — Purpose: Inflame ambition within a chosen proxy so they seize command on the summoner's behalf. Manifestation: twin-faced envoy whose smiles reflect the hunger of the court. Favours: mirror-polished bronze discs positioned behind the target's chair. Wards: issue every decree in triple witness to dissipate her lingering glamour.",
    "Andras — Purpose: Collapse alliances by sowing suspicion during council. Manifestation: winged executioner astride a wolf, talons tapping out accusations no one recalls making. Favours: unsigned contracts rushed through dusk. Wards: oak tokens passed clockwise before deliberation anchor trust against his whispers.",
    "Paimon — Purpose: Secure sovereign counsel and the loyalty of high officers through shared feasts and proclamations. Manifestation: crowned king on a dromedary, voice layered like trumpets delivering hidden arts. Favours: sweet wine, resounding choral music, and gold-threaded cushions. Wards: maintain dual ledgers—one spoken, one silent—to detect embellishment and revoke false boons.",
    "Lucifuge Rofocale — Purpose: Broker wealth-for-secrecy covenants where payment and silence must remain perfectly balanced. Manifestation: veiled chancellor whose presence dims lanternlight and muffles testimony. Favours: impeccably balanced ledgers sealed in black wax. Wards: conduct bargains at noon sunlight, notarize every exchange, and ring iron bells when the pact concludes."
  ]
}
